БухЭксп/ChartsOfCharacteristicTypes/CW_ПараметрыГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>CW_ПараметрыГрузоперевозок</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.Склады</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ЖелезнодорожныеСтанции</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторДОПОГЭПД</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_СкладыВременногоХранения</v8:Type>
				<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_РазмерыКонтейнеров</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ОфисыКомпании</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Оборудование</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Линии</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Порты</v8:Type>
				<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
				<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
				<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Авиалинии</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыДоговоров</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ОбъектыАрхива</v8:Type>
				<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ГрузоотправителиИГрузополучатели</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыКонтейнеров</v8:Type>
				<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
				<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Суда</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ДополнительныеЗначенияПараметровГрузоперевозок</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_МоделиТС</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ПодразделенияКомпании</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Рейсы</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ГруппыУслуг</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_МаркиТС</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ОтслеживаемоеОборудование</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторУпаковкиЭПД</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Терминалы</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_КлассификаторОпасныхГрузов</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Пункты</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Таможни</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыТранспортныхСредств</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_СтатусыОтслеживаемогоОборудования</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Аэропорты</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_КонтактнаяИнформация</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_КонтактыеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>18</v8:Digits>
					<v8:FractionDigits>4</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>600</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантОтбора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВариантыОтбораДляПараметров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработкаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработкаОтбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработкаПередНачаломВыбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействиеПриИзменении</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ДействияПриИзмененииКонтрольнойДаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДинамическийПараметр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕжедневныйПересчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФакт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексПиктограммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеОтбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеУсловногоОформления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФормуВводаАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФормуВыбораОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяОбработкаПередНачаломВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДополнительныеЗначения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяДатаИспользуетВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПросрочкиКонтрольнойДаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МножественноеПрямоеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПоказыватьВФормеГрузоперевозок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграниченСпискомЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчищатьПриКопировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрОтметкиУведомления</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодготовленнаяФормула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрямоеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьПолноеЗначениеПараметра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВывода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеУсловногоОформления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВедомыйПараметр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКонтрольнаяДата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСсылочныйТип</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЧисло</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОтбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьПГ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУсловия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыУсловийОтбораПараметров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользуемыеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеЗначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоступноеЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВедущиеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

БухЭксп/Enums/CW_ВариантыОтбораДляПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВариантыОтбораДляПараметров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтандартныйОтбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяОбработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыУсловийОтбораПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыУсловийОтбораПараметров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Значение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реквизит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Параметр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/ChartsOfCharacteristicTypes/CW_ПараметрыГрузоперевозок/Forms/ФормаРедактирования/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// в зависимости от режима работы либо обращаемся по ссылке, либо непосредственно
	// режим "по ссылке" создан для режима екселя
	// режим "непосредственно" - для работы из карточки г/п
	
	// заполняем
	
	Параметр = Параметры.Параметр;
	ЭтаФорма.Заголовок = Строка(Параметр); 
	
	//ХранениеПолногоЗначения  
	СохранятьПолноеЗначениеПараметра = CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр);
	Если СохранятьПолноеЗначениеПараметра Тогда
		Параметры.Свойство("ПолноеЗначение", ПолноеЗначение);
	КонецЕсли;
	//---ХранениеПолногоЗначения         
	
	РежимТолькоПросмотр = _сф.ст_ПолучитьСвойство(Параметры,"ТолькоПросмотр");
	РежимТолькоПросмотр = ?(РежимТолькоПросмотр = Неопределено, Ложь, РежимТолькоПросмотр);
	
	ЭтаФорма.ТолькоПросмотр = РежимТолькоПросмотр; 
	
	Если Параметр.ДинамическийПараметр Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;  
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Элементы.ГруппаРамка.ТолькоПросмотр = Истина;
		Элементы.ФормаОК.Видимость 			= Ложь;
		Элементы.Подтвердить.Видимость 		= Ложь;
	КонецЕсли;  
	
	Элементы.Примечание.Видимость = (НЕ Параметр.ДинамическийПараметр);
	
	Режим 			= Параметры.Режим;
	РежимОчистки	= (_сф.ст_ПолучитьСвойство(Параметры,"РежимОчистки")=Истина);
	
	Если Режим="РедактированиеОбъекта" Тогда
		// получаем из временного хранилища объект
		// и сами формируем массив "РедактируемыеОбъекты"
		РедактируемыйОбъект = ПолучитьИзВременногоХранилища(Параметры.АдресОбъекта);
		РедактируемыеОбъекты = Новый Массив;
		РедактируемыеОбъекты.Добавить(РедактируемыйОбъект);
	ИначеЕсли Режим="РедактированиеСписка" Тогда 
		РедактируемыеОбъекты = Параметры.РедактируемыеОбъекты;   
		Если РедактируемыеОбъекты.Количество() = 0 Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		РедактируемыйОбъект = РедактируемыеОбъекты[0];
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	// заполняем для одиночного редактируемого
	// для нескольких проверяем значения, если совпадают - подставляем, нет - формируем список выбора
	КоличествоРедактируемыхОбъектов = РедактируемыеОбъекты.Количество();
	Если (КоличествоРедактируемыхОбъектов = 1) Тогда
		
		ИмяТЧ = CW_Мониторинг.ТабличнаяЧастьПараметровОбъекта(РедактируемыйОбъект); 
		Если ИмяТЧ <> Неопределено Тогда
			
			СтрокаПараметра = _сф.к_НайтиСтроку(РедактируемыйОбъект[ИмяТЧ],"Параметр",Параметр);
			Если СтрокаПараметра <> Неопределено Тогда
				
				Значение = СтрокаПараметра.Значение; 
				
				Если Параметр.ЭтоКонтрольнаяДата Тогда
					ЗначениеПлан = СтрокаПараметра.ЗначениеПлан;
					ЗначениеФакт = СтрокаПараметра.ЗначениеФакт;
					Если (Параметр.КонтрольнаяДатаИспользуетВремя) Тогда
						// заполняем время план и время факт
						ДатаПланСтрокой = Формат(ЗначениеПлан,"ДФ=yyyyMMddHHmmss");
						ВремяПлан 		= Дата("00010101"+Сред(ДатаПланСтрокой,9));
						ДатаФактСтрокой = Формат(ЗначениеФакт,"ДФ=yyyyMMddHHmmss");
						ВремяФакт 		= Дата("00010101"+Сред(ДатаФактСтрокой,9));
					КонецЕсли;
				КонецЕсли;
				
				Примечание = СтрокаПараметра.Примечание;   
				
				Если СохранятьПолноеЗначениеПараметра 
					И Не ЗначениеЗаполнено(ПолноеЗначение) Тогда
					ПолноеЗначение = СтрокаПараметра.ХранилищеДанных.Получить();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;  
	
	
	Если КоличествоРедактируемыхОбъектов > 1 Тогда
		
		Значение_Список		= Ложь;
		ЗначениеПлан_Список	= Ложь;
		ЗначениеФакт_Список	= Ложь;
		Примечание_Список	= Ложь;
		
		ТЗ = _сф.т_Создать("Значение,ЗначениеПлан,ЗначениеФакт,Примечание");
		ЕстьОтсутствующие = Ложь;
		
		Для каждого РедактируемыйОбъект Из РедактируемыеОбъекты Цикл
			
			ЕстьОтсутствующие = ложь;
			ИмяТЧ = CW_Мониторинг.ТабличнаяЧастьПараметровОбъекта(РедактируемыйОбъект); 
			
			Если ИмяТЧ <> Неопределено Тогда
				СтрокаПараметра = _сф.к_НайтиСтроку(РедактируемыйОбъект[ИмяТЧ],"Параметр",Параметр);
				Если СтрокаПараметра <> Неопределено Тогда
					Нстр = ТЗ.Добавить();
					ЗаполнитьЗначенияСвойств(Нстр,СтрокаПараметра);  
				Иначе
					ЕстьОтсутствующие = Истина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла; 
		
		Если НЕ Параметр.ЭтоКонтрольнаяДата Тогда
			// сворачиваем
			ТЗ_Значение = ТЗ.Скопировать(,"Значение");
			ТЗ_Значение.Свернуть("Значение");
			Если ТЗ_Значение.Количество() > 0 Тогда 
				Если ТЗ_Значение.Количество() = 1 И (НЕ ЕстьОтсутствующие) Тогда
					Значение = ТЗ_Значение[0].Значение;
				Иначе
					// формируем список выбора
					Если ТЗ_Значение.Количество() <> 0 Тогда
						Элементы.Значение.КнопкаСпискаВыбора=Истина;
						Элементы.Значение.СписокВыбора.Очистить();
						Элементы.Значение.СписокВыбора.ЗагрузитьЗначения(ТЗ_Значение.ВыгрузитьКолонку("Значение"));
					КонецЕсли; 
					// помечаем как списочный
					Значение_Список=Истина;
					Элементы.Значение.Заголовок="Значение*";
					Элементы.Значение.КнопкаВыпадающегоСписка=Истина;
				КонецЕсли; 
			КонецЕсли; 
		Иначе
			// сворачиваем
			ТЗ_Значение = ТЗ.Скопировать(,"ЗначениеПлан");
			ТЗ_Значение.Свернуть("ЗначениеПлан");
			Если ТЗ_Значение.Количество() > 0 Тогда 
				Если ТЗ_Значение.Количество() = 1 И (НЕ ЕстьОтсутствующие) Тогда
					ЗначениеПлан = ТЗ_Значение[0].ЗначениеПлан;
					// --- 
					ДатаПланСтрокой = Формат(ЗначениеПлан,"ДФ=yyyyMMddHHmmss");
					ВремяПлан = Дата("00010101"+Сред(ДатаПланСтрокой,9));
				Иначе
					// помечаем как списочный
					ЗначениеПлан_Список=Истина;
					Элементы.ЗначениеПлан.Заголовок="План*";
				КонецЕсли;
			КонецЕсли;
			// сворачиваем
			ТЗ_Значение = ТЗ.Скопировать(,"ЗначениеФакт");
			ТЗ_Значение.Свернуть("ЗначениеФакт");
			Если ТЗ_Значение.Количество() > 0 Тогда 
				Если ТЗ_Значение.Количество() = 1 И (НЕ ЕстьОтсутствующие) Тогда
					ЗначениеФакт = ТЗ_Значение[0].ЗначениеФакт;
					// --- 
					ДатаФактСтрокой = Формат(ЗначениеФакт,"ДФ=yyyyMMddHHmmss");
					ВремяФакт = Дата("00010101"+Сред(ДатаФактСтрокой,9));
				Иначе
					// помечаем как списочный
					ЗначениеФакт_Список=Истина;
					Элементы.ЗначениеФакт.Заголовок="Факт*";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
		ТЗ_Примечание = ТЗ.Скопировать(,"Примечание");
		ТЗ_Примечание.Свернуть("Примечание");
		Если ТЗ_Значение.Количество() > 0 Тогда 
			Если ТЗ_Примечание.Количество() = 1 И (НЕ ЕстьОтсутствующие) Тогда
				Примечание = ТЗ_Примечание[0].Примечание;
			Иначе
				// помечаем как списочный
				Примечание_Список=Истина;
				Элементы.Примечание.Заголовок="Примечание*";
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли; 
	
	Если Параметр.ИспользованиеОтбора Тогда
		_СформироватьПараметрыОтбора(РедактируемыйОбъект);
	КонецЕсли; 
	
	ОграниченСпискомЗначений = Параметр.ОграниченСпискомЗначений;
	
	Если (ОграниченСпискомЗначений ИЛИ Параметр.ИспользованиеОтбора) Тогда
		
		Элементы.Значение.РедактированиеТекста=Ложь;
		Элементы.Значение.РежимВыбораИзСписка=Ложь;
		Элементы.Значение.КнопкаВыбора  = Истина;
		Элементы.Значение.КнопкаОчистки = Истина;
		Элементы.Значение.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		Элементы.Значение.КнопкаВыпадающегоСписка=Ложь;
		Элементы.Значение.СписокВыбора.Очистить();
		Элементы.Значение.ИсторияВыбораПриВводе=ИсторияВыбораПриВводе.НеИспользовать;
		
	КонецЕсли; 
	
	Если (НЕ РежимТолькоПросмотр) Тогда
		
		АдресСвойствПараметра = _сф.ст_ПолучитьСвойство(Параметры,"АдресСвойствПараметра");
		Если (АдресСвойствПараметра <> Неопределено) Тогда
			
			СвойстваПараметра = ПолучитьИзВременногоХранилища(АдресСвойствПараметра);
			ПредставлениеВедомыхПараметров = СвойстваПараметра.СписокВедомыхСтрокой;
			// --- 
			Если (СвойстваПараметра.Ведущий) Тогда
				
				Для каждого РО Из РедактируемыеОбъекты Цикл
					
					ЕстьЗаполненныеВедомые = _ПроверитьЗаполнениеВедомых(СвойстваПараметра.СписокВедомых,РО);
					Если (ЕстьЗаполненныеВедомые) Тогда
						Прервать;
					КонецЕсли; 
					
				КонецЦикла; 
				
			КонецЕсли; 
			// --- 
			Если (СвойстваПараметра.Ведомый) Тогда
				
				// проверяем ведущие на заполненность
				Для каждого РО Из РедактируемыеОбъекты Цикл
					Результат = _ПроверитьЗаполнениеВедущих(Параметр,СвойстваПараметра.СписокВедущих,РО);
					Если (НЕ _УФКС.ВыполненоУспешно(Результат)) Тогда
						
						ТекстПредупрежденияПриОткрытии=_УФКС.ПредставлениеОшибки(Результат);
						ПредупреждениеПриОткрытии=Истина;
						ЗапретРедактированияЗначения = Истина;
						
					КонецЕсли;
				КонецЦикла; 
				
			КонецЕсли; 
			
			Если СвойстваПараметра.ИспользуютсяДополнительныеЗначения Тогда
				
				МассивСвязиПараметровВыбора = новый Массив;
				МассивСвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Параметр"));
				
				СвязиПараметровВыбора 		= Новый ФиксированныйМассив(МассивСвязиПараметровВыбора);
				
				Элементы.Значение.СвязиПараметровВыбора = СвязиПараметровВыбора;
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли;  
	
	ИспользоватьФормуВводаАдреса = Параметр.ИспользоватьФормуВводаАдреса;
	Если ИспользоватьФормуВводаАдреса Тогда
		Элементы.Значение.КнопкаВыбора = Истина;
	КонецЕсли;
	
	УправлениеЭлементамиФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если (ПредупреждениеПриОткрытии) Тогда
		
		_УФК.ВывестиПредупреждение(ТекстПредупрежденияПриОткрытии);
		
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _СформироватьПараметрыОтбора(РедактируемыйОбъект)
	// --- 
	
	Если (Параметр.ВариантОтбора=Перечисления.CW_ВариантыОтбораДляПараметров.СтандартныйОтбор) Тогда
		
		МассивПараметровВыбора = Новый Массив;
		Для каждого ПараметрВыбора Из Параметр.ПараметрыОтбора Цикл
			
			Если (ПараметрВыбора.ВидУсловия = Перечисления.CW_ВидыУсловийОтбораПараметров.Значение) Тогда
				
				НовыйПараметр = Новый ПараметрВыбора(ПараметрВыбора.РеквизитОтбора,ПараметрВыбора.Значение);
				МассивПараметровВыбора.Добавить(НовыйПараметр);
				
			ИначеЕсли (ПараметрВыбора.ВидУсловия = Перечисления.CW_ВидыУсловийОтбораПараметров.Реквизит) Тогда
				
				Попытка
					
					ИмяРеквизита = ПараметрВыбора.Значение;
					Если (ИмяРеквизита = "Клиент") Тогда
						Если (ТипЗнч(РедактируемыйОбъект.Ссылка)=Тип("СправочникСсылка.CW_Заявки")) Тогда
							ИмяРеквизита = "Контрагент";
						КонецЕсли; 
					КонецЕсли; 
					
					СсылкаОбъекта = РедактируемыйОбъект.Ссылка;
					ЗначениеРеквизита = СсылкаОбъекта[ИмяРеквизита];
					
				Исключение
					ЗначениеРеквизита = Неопределено;
				КонецПопытки; 
				
				Если (ЗначениеРеквизита <> Неопределено) Тогда
					
					Если (ЗначениеЗаполнено(ЗначениеРеквизита)) Тогда
						
						НовыйПараметр = Новый ПараметрВыбора(ПараметрВыбора.РеквизитОтбора,ЗначениеРеквизита);
						МассивПараметровВыбора.Добавить(НовыйПараметр);
						
					КонецЕсли; 
					
				КонецЕсли; 
				
				
			ИначеЕсли (ПараметрВыбора.ВидУсловия = Перечисления.CW_ВидыУсловийОтбораПараметров.Параметр) Тогда
				
				ИмяТЧ = CW_Мониторинг.ТабличнаяЧастьПараметровОбъекта(РедактируемыйОбъект); 
				
				Если ИмяТЧ <> Неопределено Тогда
					
					// в качестве значения подставляем значение параметра 
					СтрокаПараметра = _сф.к_НайтиСтроку(РедактируемыйОбъект[ИмяТЧ],"Параметр",ПараметрВыбора.Значение);
					Если СтрокаПараметра <> Неопределено Тогда
						НовыйПараметр = Новый ПараметрВыбора(ПараметрВыбора.РеквизитОтбора,СтрокаПараметра.Значение);
						МассивПараметровВыбора.Добавить(НовыйПараметр);
					КонецЕсли;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		//Элементы.Значение.ВыборГруппИЭлементов=ГруппыИЭлементы.ГруппыИЭлементы;
		
		ПараметрыФормыВыбора = Новый Структура("ИмяФормы,ПараметрыФормы,ПараметрыВыбора","",Новый Структура,Новый Массив);
		Для каждого Стр Из МассивПараметровВыбора Цикл
			
			// 
			ТипПараметра = Этаформа.Параметр.ТипЗначения.Типы()[0];
			СсылкаТипа = Новый(ТипПараметра);
			ПараметрыФормыВыбора.ИмяФормы = СсылкаТипа.Метаданные().ПолноеИмя()+".ФормаВыбора";
			// --- 
			Если (Стр.Имя = "Отбор.Родитель") Тогда
				
				// ПараметрВыбора.Значение.Ссылка.Метаданные().ПолноеИмя()
				
				ПараметрыФормыВыбора.ИмяФормы = Стр.Значение.Метаданные().ПолноеИмя()+".ФормаВыбора";
				ПараметрыФормыВыбора.ПараметрыФормы.Вставить("РежимВыбора",Истина);
				
				Если (Стр.Значение.Метаданные().ПолноеИмя()="Справочник.Контрагенты") Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
					|	Контрагенты.Ссылка
					|ИЗ
					|	Справочник.Контрагенты КАК Контрагенты
					|ГДЕ
					|	Контрагенты.Родитель = &Родитель";
					Запрос.УстановитьПараметр("Родитель",Стр.Значение);
					Первый = _сф.ВыполнитьЗапрос(Запрос,,Истина,"Ссылка",Неопределено);
					Если (Первый <> Неопределено) Тогда
						
						ПараметрыФормыВыбора.ПараметрыФормы.Вставить("ТекущаяСтрока",Первый);
						
					Иначе
						
						ПараметрыФормыВыбора.ПараметрыФормы.Вставить("ТекущаяСтрока",Стр.Значение);
						
					КонецЕсли; 
					
				Иначе
					
					ПараметрыФормыВыбора.ПараметрыФормы.Вставить("ТекущаяСтрока",Стр.Значение);
					
				КонецЕсли; 
				
				ПН = Новый НастройкиКомпоновкиДанных;
				ЭлементОтбора = ПН.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
				ЭлементОтбора.ПравоеЗначение = Стр.Значение;
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора.Применение=ТипПримененияОтбораКомпоновкиДанных.ТолькоИерархия;
				ПараметрыФормыВыбора.ПараметрыФормы.Вставить("ФиксированныеНастройки", ПН);
				
				
			Иначе
				
				ПараметрыФормыВыбора.ПараметрыВыбора.Добавить(Стр);
				ПараметрыФормыВыбора.ПараметрыФормы.Вставить("РежимВыбора",Истина);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		// добавляем параметры выбора в отбор
		ПараметрыФормыВыбора.ПараметрыФормы.Вставить("Отбор",Новый Структура);
		Для каждого Стр Из ПараметрыФормыВыбора.ПараметрыВыбора Цикл
			
			ПараметрыФормыВыбора.ПараметрыФормы.Отбор.Вставить(СтрЗаменить(Стр.Имя,"Отбор.",""),Стр.Значение);
			
		КонецЦикла; 
		
		АдресПараметровФормыВыбораСсылочногоТипа = ПоместитьВоВременноеХранилище(ПараметрыФормыВыбора,УникальныйИдентификатор);
		Элементы.Значение.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыФормыВыбора.ПараметрыВыбора);
		
	КонецЕсли; 
	// --- 
	Если (Параметр.ВариантОтбора=Перечисления.CW_ВариантыОтбораДляПараметров.ВнешняяОбработка) Тогда
		
		ОбработкаОбъект = _ПО.ПолучитьОбработку(Параметр.ВнешняяОбработкаОтбора);
		// Параметры:
		// Параметр - текущий редактируемый параметр
		// РедактируемыйОбъект - грузоперевозка, заявки или другое
		// ТекущееЗначение - Текущее значение параметра
		// ВозвращаемоеЗначение: Структура:
		// ИмяФормы - полное имя формы
		// ПараметрыФормы - внезапно, параметры формы
		// ПараметрыВыбора - массив фиксированных структур или пустой массив (?) - зачем он нужен не очень понятно
		// --- 
		// пример заполнения структуры в предыдущей ветке
		// --- 
		ПараметрыФормыВыбора = ОбработкаОбъект.ПараметрыФормыВыбора(Параметр,РедактируемыйОбъект,Значение);
		ОбработкаОбъект = Неопределено;
		// = 
		АдресПараметровФормыВыбораСсылочногоТипа = ПоместитьВоВременноеХранилище(ПараметрыФормыВыбора,УникальныйИдентификатор);
		Элементы.Значение.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыФормыВыбора.ПараметрыВыбора); 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормыНаСервере()
	
	ПоказатьЗначение = НЕ Параметр.СохранятьПолноеЗначениеПараметра И НЕ Параметр.ЭтоКонтрольнаяДата;
	
	Если Параметр.ЭтоКонтрольнаяДата Тогда
		Элементы.ГруппаКД.Видимость = Истина;
		Элементы.ГруппаКД.ТолькоПросмотр = ЗапретРедактированияЗначения;
		ЭтоКонтрольнаяДата=Истина;
	Иначе
		Элементы.Значение.ТолькоПросмотр = ЗапретРедактированияЗначения;
		Элементы.ГруппаКД.Видимость = Ложь;
		ЭтоКонтрольнаяДата=Ложь;
		// определяем тип значения параметра
		Элементы.Значение.ОграничениеТипа = Параметр.ТипЗначения;
	КонецЕсли; 
	
	Элементы.ГруппаВремяПлан.Видимость = (ЭтоКонтрольнаяДата И Параметр.КонтрольнаяДатаИспользуетВремя);
	Элементы.ГруппаВремяФакт.Видимость = (ЭтоКонтрольнаяДата И Параметр.КонтрольнаяДатаИспользуетВремя);
	
	Элементы.ВремяПлан.Доступность = ЗначениеЗаполнено(ЗначениеПлан);
	Элементы.ВремяФакт.Доступность = ЗначениеЗаполнено(ЗначениеФакт);
	
	//ХранениеПолногоЗначения
	Элементы.ПолноеЗначение.Видимость 	= Параметр.СохранятьПолноеЗначениеПараметра;
	Элементы.Значение.Видимость 		= ПоказатьЗначение;
	//---ХранениеПолногоЗначения
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОК(Команда)
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		
		Если СтрДлина(СокрЛП(Значение)) > 600 Тогда
			
			ПоказатьПредупреждение(,"Длина значения параметра не может превышать 600 символов!");
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// проверяем, если у параметра есть заполненные ведомые и параметр изменён, то предупреждаем об очистке ведомых
	Если (ПараметрИзменен И ЕстьЗаполненныеВедомые) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаОчисткиПараметров",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Ведомые параметры """+ПредставлениеВедомыхПараметров+""" будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВыполнитьЗакрытие();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОчисткиПараметров(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ=КодВозвратаДиалога.Да) Тогда
		
		ВыполнитьЗакрытие();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ВыполнитьЗакрытие()
	
	_СформироватьЗначения();   
	
	Если СохранятьПолноеЗначениеПараметра и НЕ ИспользоватьФормуВводаАдреса Тогда
		Значение = ПолноеЗначение;
	КонецЕсли;    
	
	СтруктураЗначения = CW_МониторинговыеПараметрыСервер.ПолучитьПустуюСтруктуруРедактированияПараметров();
	СтруктураЗначения.Параметр 			= Параметр;
	СтруктураЗначения.ПараметрИзменен 	= ПараметрИзменен;
	СтруктураЗначения.Значение			= ?(Значение_Список,		Неопределено,	?(ЭтоКонтрольнаяДата,Дата(1,1,1),Значение));
	СтруктураЗначения.ЗначениеПлан 		= ?(ЗначениеПлан_Список,	Неопределено,	ЗначениеПлан);
	СтруктураЗначения.ЗначениеФакт 		= ?(ЗначениеФакт_Список,	Неопределено,	ЗначениеФакт);
	СтруктураЗначения.Примечание 		= ?(Примечание_Список,		Неопределено,	Примечание);
	СтруктураЗначения.ПолноеЗначение	= ПолноеЗначение;
	
	ЭтаФорма.Закрыть(СтруктураЗначения);
	
КонецПроцедуры  
  
&НаСервере
Процедура _СформироватьЗначения()
	
	Если (Параметр.ЭтоКонтрольнаяДата И Параметр.КонтрольнаяДатаИспользуетВремя) Тогда
		
		ДатаПланСтрокой = Формат(ЗначениеПлан,"ДФ=yyyyMMddHHmmss");
		ВремяПланСтрокой = Формат(ВремяПлан,"ДФ=yyyyMMddHHmmss");
		Если (ДатаПланСтрокой <> "") Тогда
			
			Если (ВремяПланСтрокой <> "") Тогда
				ЗначениеПлан = Дата(Лев(ДатаПланСтрокой,8)+Сред(ВремяПланСтрокой,9));
			Иначе
				ЗначениеПлан = Дата(Лев(ДатаПланСтрокой,8)+"000000");
			КонецЕсли; 
			
		КонецЕсли; 

		ДатаФактСтрокой = Формат(ЗначениеФакт,"ДФ=yyyyMMddHHmmss");
		ВремяФактСтрокой = Формат(ВремяФакт,"ДФ=yyyyMMddHHmmss");
		Если (ДатаФактСтрокой <> "") Тогда
			
			Если (ВремяФактСтрокой <> "") Тогда
				ЗначениеФакт = Дата(Лев(ДатаФактСтрокой,8)+Сред(ВремяФактСтрокой,9));
			Иначе
				ЗначениеФакт = Дата(Лев(ДатаФактСтрокой,8)+"000000");
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры
 


&НаСервере
Функция _ПроверитьЗаполнениеВедомых(СписокВедомых,ПроверяемыйОбъект)
	
	ИмяТЧ = CW_Мониторинг.ТабличнаяЧастьПараметровОбъекта(ПроверяемыйОбъект); 
	Если ИмяТЧ <> Неопределено Тогда
		Для каждого ВедомыйПараметр Из СписокВедомых Цикл
			
			СтрокаПараметра = _сф.к_НайтиСтроку(ПроверяемыйОбъект[ИмяТЧ], "Параметр", ВедомыйПараметр.Значение);
			Если (СтрокаПараметра <> Неопределено) Тогда
				
				Если ЗначениеЗаполнено(СтрокаПараметра.Значение) Тогда
					Возврат(Истина);
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Возврат(_УФКС.Ответ());
	
КонецФункции

&НаСервере
Функция _ПроверитьЗаполнениеВедущих(Параметр,СписокВедущих,ПроверяемыйОбъект)
	// --- 
	
	ИмяТЧ = CW_Мониторинг.ТабличнаяЧастьПараметровОбъекта(ПроверяемыйОбъект); 
	
	Если ИмяТЧ <> Неопределено Тогда
		Возврат(_УФКС.Ответ());
	Конецесли;
	
	Если (ТипЗнч(ПроверяемыйОбъект[ИмяТЧ])=Тип("ТаблицаЗначений")) Тогда
		ТЗПараметров = ПроверяемыйОбъект[ИмяТЧ];
	Иначе
		ТЗПараметров = ПроверяемыйОбъект[ИмяТЧ].Выгрузить();
	КонецЕсли; 
	
	// контроллируем заполнение и единство
	ФлагОшибки = Ложь;
	ТекстОшибки = "";
	Для каждого ВедущийПГ Из СписокВедущих Цикл
		
		// проверяем параметр у переданных объектов
		МассивНепустыхЗначений = Новый Массив;
		
		ВедущийПараметр = ВедущийПГ.Значение;
		СтрокаПараметра = _сф.к_НайтиСтроку(ТЗПараметров,"Параметр",ВедущийПараметр);
		Если СтрокаПараметра = Неопределено Тогда
			
			ЗначениеПараметра = Неопределено;
			
		Иначе
			
			ЗначениеПараметра = СтрокаПараметра.Значение;
			
		КонецЕсли; 
		Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			
			_сф.м_ДобавитьУникально(МассивНепустыхЗначений,ЗначениеПараметра);
			
		Иначе
			
			ФлагОшибки = Истина;
			ТекстОшибки = "";
			
		КонецЕсли; 
		
		
		// теперь если нет ошибки считаем количество
		// если не 1, то выдаём ошибку
		Если НЕ ФлагОшибки Тогда
			
			Если МассивНепустыхЗначений.Количество() <> 1 Тогда
				
				ФлагОшибки = Истина;
				ТекстОшибки = ""
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если ФлагОшибки Тогда
			
			// тут необходимо закрыть форму и вернуть описание ошибки
			ТекстОшибки = "Условия отбора для выбранного параметра ("""+Параметр.Наименование+""") требуют, чтобы было задано значение параметра """+ВедущийПараметр.Наименование+""".";
			Возврат(_УФКС.Ответ(1,ТекстОшибки));
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаКлиенте
Процедура Подтвердить(Команда)
	
	ЗначениеФакт = ЗначениеПлан;
	ПараметрИзменен=Истина;
	ЗначениеФакт_Список=Ложь;
	ВремяФакт = ВремяПлан;
	Элементы.ЗначениеФакт.Заголовок="Факт";
	// --- 
	УправлениеЭлементамиФормыНаСервере();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ЗначениеПриИзменении(Элемент)
	
	ПараметрИзменен=Истина;
	Значение_Список=Ложь;
	Элементы.Значение.Заголовок="Значение";
	
КонецПроцедуры   

&НаКлиенте
Процедура ПолноеЗначениеПриИзменении(Элемент)
	ПараметрИзменен=Истина;
	Значение_Список=Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ЗначениеПланПриИзменении(Элемент)
	
	ПараметрИзменен=Истина;
	ЗначениеПлан_Список=Ложь;
	Элементы.ЗначениеПлан.Заголовок="План";
	// --- 
	Если (ЗначениеПлан = Дата(1,1,1)) Тогда
		ВремяПлан = Неопределено;
	КонецЕсли; 
	// --- 
	УправлениеЭлементамиФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеФактПриИзменении(Элемент)
	
	ПараметрИзменен=Истина;
	ЗначениеФакт_Список=Ложь;
	Элементы.ЗначениеФакт.Заголовок="Факт";
	// --- 
	Если (ЗначениеФакт = Дата(1,1,1)) Тогда
		ВремяФакт = Неопределено;
	КонецЕсли; 
	// --- 
	УправлениеЭлементамиФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПримечаниеПриИзменении(Элемент)
	
	Примечание_Список=Ложь;
	ПараметрИзменен = Истина;
	Элементы.Примечание.Заголовок = "Примечание";
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПланПриИзменении(Элемент)
	
	ПараметрИзменен = Истина;
	ЗначениеПлан_Список=Ложь;
	Элементы.ЗначениеПлан.Заголовок="План";
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяФактПриИзменении(Элемент)
	
	ПараметрИзменен = Истина;
	ЗначениеФакт_Список=Ложь;
	Элементы.ЗначениеФакт.Заголовок="Факт";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Если ОграниченСпискомЗначений Тогда
		ВыбратьИзСпискаЗначений(Элемент, СтандартнаяОбработка);
	КонецЕсли;
	
	Если АдресПараметровФормыВыбораСсылочногоТипа <> "" Тогда
		ВыбратьИзДоступныхЗначений(Элемент, СтандартнаяОбработка);
	КонецЕсли; 
	
	Если ИспользоватьФормуВводаАдреса Тогда  
		ВыбратьАдрес(СтандартнаяОбработка);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьАдрес(СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыВводаАдреса = 
		УправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(
		ОбменСГИСЭПДВызовСервера.ВидФактическийАдресКонтрагента(), 
		ПолноеЗначение);
	
	Оповещение = Новый ОписаниеОповещения("ВводАдреса_Завершение", ЭтотОбъект);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормыВводаАдреса, ЭтаФорма, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзДоступныхЗначений(Элемент, СтандартнаяОбработка)
	
	ДанныеФормыВыбора = ПолучитьИзВременногоХранилища(АдресПараметровФормыВыбораСсылочногоТипа);
	Если Не ПустаяСтрока(ДанныеФормыВыбора.ИмяФормы) Тогда
		
		СтандартнаяОбработка = Ложь;
	
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораЗначенияИзДоступных",ЭтотОбъект); 
		ОткрытьФорму(ДанныеФормыВыбора.ИмяФормы, 
		ДанныеФормыВыбора.ПараметрыФормы,
		Элемент,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзСпискаЗначений(Элемент, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ОбработкаВыбораЗначенияИзДоступных",ЭтотОбъект);    
	СтруктураПараметров = Новый Структура("Параметр",Параметр);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаВыбораДоступныхЗначенийПараметра", 
		СтруктураПараметров, 
		Элемент,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры  

&НаКлиенте
Процедура ВводАдреса_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Значение 		= Результат.Представление;
	ПолноеЗначение 	= Результат.КонтактнаяИнформация; 

	ПараметрИзменен 	= Истина;
	
КонецПроцедуры        

&НаКлиенте
Процедура ОбработкаВыбораЗначенияИзДоступных(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = Неопределено Тогда    
		Возврат;
	КонецЕсли;
	
	Значение = Ответ;
	ЗначениеПриИзменении(Элементы.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Если ОграниченСпискомЗначений Тогда
		СтандартнаяОбработка=Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеОткрытие(Элемент, СтандартнаяОбработка)
	
	Если (ТипЗнч(Значение) = Тип("СправочникСсылка.Контрагенты")) Тогда
		
		Если (ПолучитьФункциональнуюОпциюФормы("CW_ИспользованиеCRM")) Тогда
			
			// получаем настройку пользователя
			ИспользоватьСобственнуюФорму = (CW_Настройки.ПолучитьНастройкуПользователя( , "ИспользуемаяФормаКонтрагента") <> 0);
			Если (ИспользоватьСобственнуюФорму) Тогда
				
				СтандартнаяОбработка = Ложь;
				// --- 
				Если (ЗначениеЗаполнено(Значение)) Тогда
					ПФ = Новый Структура("ВидФормы,Ссылка","ФормаКонтрагента",Значение);
					ОткрытьФорму("ОбщаяФорма.CW_ФормаКонтактнойИнформации",ПФ,Элемент,Истина);	
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли;
		
	ИначеЕсли (ТипЗнч(Значение) = Тип("СправочникСсылка.ФизическиеЛица")) Тогда 
		
		Если (ПолучитьФункциональнуюОпциюФормы("CW_ИспользованиеCRM")) Тогда
			
			// получаем настройку пользователя
			ИспользоватьСобственнуюФорму = (CW_Настройки.ПолучитьНастройкуПользователя( , "ИспользуемаяФормаКонтрагента") <> 0);
			Если (ИспользоватьСобственнуюФорму) Тогда
				
				СтандартнаяОбработка = Ложь;
				// --- 
				Если (ЗначениеЗаполнено(Значение)) Тогда
					ПФ = Новый Структура("ВидФормы,Ссылка","ФормаФизическогоЛица",Значение);
					ОткрытьФорму("ОбщаяФорма.CW_ФормаКонтактнойИнформации",ПФ,Элемент,Истина);	
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры
